** Org can evaluate programming languages blocks
You can include snippets of code in Org with the BEGIN_SRC syntax:

#+BEGIN_SRC python
return sorted([5, 2, 4, 3, 1])
#+END_SRC

Here we are telling Org that the code is in Python, so we get proper syntax
highlighting.  But that's not all!

The advantage of Org source blocks is that you can /evaluate/ them with C-c C-c
with the block under point:

#+BEGIN_SRC python
return sorted([5, 2, 4, 3, 1])
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 |

(You may need to (require 'ob-python) first.)

We get the sorted list, parsed automatically as an Org table (so we can reuse it
in the Org document, or even pass it to other source blocks!).

Org can evaluate many common programming languages like this.  When exporting,
Org can re-run all your code blocks to update the results.  You can even choose
whether to export the code, the results, or both.

Evaluating source blocks is very useful when writing tutorials ([[#ex:tp][Example 4]]), or
doing literate data visualization ([[#ex:blog][Example 5]]).

** Example of a students grades table
I use the spreadsheet mostly for keeping track of student grades.  Here is an
example of the tables I create (names of the guilty have been replaced with
[[https://en.wikipedia.org/wiki/List_of_valkyrie_names][Valkyries]]):

| Name          |    1 |   2 |   3 |   4 |   5 | Grade |
|---------------+------+-----+-----+-----+-----+-------|
| Brynhildr     |    1 |   1 |   1 |   1 |   1 |     5 |
| Eir           |    1 |  .5 |   1 |     |     |   2.5 |
| Geirahöð      |    1 |   1 |   1 |   1 |     |     4 |
| Geiravör      |    1 |   1 |   1 |  .5 |     |   3.5 |
| Geirdriful    |    1 |   1 |   1 |   1 |     |     4 |
| Geirönul      |      |  .5 |  .5 |  .5 |     |   1.5 |
| Geirskögul    |   .5 |   1 |   1 |   1 |   1 |   4.5 |
| Göll          |   .5 |   1 |  .5 |  .5 |     |   2.5 |
| Göndul        |   .5 |   1 |   1 |  .5 |     |    3. |
| Guðr          |    1 |  .5 |   1 |  .5 |  .5 |   3.5 |
| Herfjötur     |    1 |   1 |  .5 |  .5 |  .5 |   3.5 |
| Herja         |      |     |     |     |     |     0 |
| Hlaðguðr      |   .5 |   1 |   1 |     |     |   2.5 |
| Hildr         |    1 |     |  .5 |  .5 |  .5 |   2.5 |
| Hjalmþrimul   |    1 |   1 |  .5 |  .5 |     |    3. |
| Hervör alvitr |    1 |     |  .5 |     |     |   1.5 |
| Hjörþrimul    |    1 |   1 |   1 |  .5 |     |   3.5 |
| Hlökk         |      |  .5 |  .5 |     |     |    1. |
| Hrist         |    1 |   1 |  .5 |  .5 |  .5 |   3.5 |
| Hrund         |   .5 |  .5 |   1 |     |     |    2. |
| Kára          |   .5 |   1 |   1 |  .5 |   1 |    4. |
| Mist          |    1 |   1 |   1 |  .5 |   1 |   4.5 |
| Ölrún         |    1 |   1 |  .5 |  .5 |  .5 |   3.5 |
| Randgríðr     |   .5 |   1 |   1 |  .5 |     |    3. |
| Ráðgríðr      |    1 |   1 |  .5 |  .5 |     |    3. |
| Reginleif     |      |   1 |   1 |     |   1 |     3 |
| Róta          |    1 |  .5 |   1 |  .5 |     |    3. |
|---------------+------+-----+-----+-----+-----+-------|
| Answers       | 19.5 | 21. | 21. | 12. | 7.5 |       |
|---------------+------+-----+-----+-----+-----+-------|
| Mean          |      |     |     |     |     |  3.00 |
| Std Deviation |      |     |     |     |     |  1.12 |
#+TBLFM: @2$7..@28$7=vsum($2..$6);NE::@29$2..@29$6=vsum(@I..@II)::@30$7=vmean(@I..@II);%.2f::@31$7=vsdev(@I..@II);%.2f

Org has structured editing for tables: I can move rows and columns around, I can
add new lines or columns... and it's still just text.

I have one column for each question on the exam.  Points are either zero
(empty), half (.5) or full (1).  The total for each student is summed in the
Grade column automatically.

Answers to all questions can also be seen in the Answers row.  Question 5 was
more difficult it seems.

Org can also compute the mean and standard deviation for the grades.  These
formulas are added in the TBLFM line below the table (see [[info:org#The%20spreadsheet][The spreadsheet]] part
of the Org manual).

In fact, the Org spreadsheet can use either the Emacs built-in Calc calculator,
or arbitrary Lisp, so you could take the customization pretty far.

